app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "かいけつゾロリ"], ["body", "面白い"], ["created_at", "2020-10-08 13:57:12.746483"], ["updated_at", "2020-10-08 13:57:12.746483"], ["user_id", 1]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = current_user
    if @book.save